In [1]:
# 处理缺失数据

In [4]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocada'])

In [5]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocada
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0]=None

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
from numpy import nan as NA

In [10]:
data = pd.Series([1,NA,3.5,NA,7])

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [13]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [18]:
data=pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [19]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [21]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [22]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [25]:
data[4]=NA

In [26]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [27]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [28]:
df=pd.DataFrame(np.random.randn(7,3))

In [29]:
df

          0         1         2
0  1.282884  0.115687  0.085490
1 -1.220237 -0.718670  1.014738
2  0.364589 -0.773125 -1.041544
3  0.224896  0.376919  1.722356
4  1.525739  1.903656  0.607947
5 -2.030629 -0.151804 -0.695825
6  0.832581  0.973555 -0.180363

In [30]:
df.iloc[0:4,1]=NA
df.iloc[:2,2]=NA

In [31]:
df

          0         1         2
0  1.282884       NaN       NaN
1 -1.220237       NaN       NaN
2  0.364589       NaN -1.041544
3  0.224896       NaN  1.722356
4  1.525739  1.903656  0.607947
5 -2.030629 -0.151804 -0.695825
6  0.832581  0.973555 -0.180363

In [32]:
df.dropna()

          0         1         2
4  1.525739  1.903656  0.607947
5 -2.030629 -0.151804 -0.695825
6  0.832581  0.973555 -0.180363

In [33]:
df.dropna(thresh=2)

          0         1         2
2  0.364589       NaN -1.041544
3  0.224896       NaN  1.722356
4  1.525739  1.903656  0.607947
5 -2.030629 -0.151804 -0.695825
6  0.832581  0.973555 -0.180363

In [34]:
## 填充缺失值

In [35]:
df.fillna(0)

          0         1         2
0  1.282884  0.000000  0.000000
1 -1.220237  0.000000  0.000000
2  0.364589  0.000000 -1.041544
3  0.224896  0.000000  1.722356
4  1.525739  1.903656  0.607947
5 -2.030629 -0.151804 -0.695825
6  0.832581  0.973555 -0.180363

In [36]:
df.fillna({1:0.5,2:0})

          0         1         2
0  1.282884  0.500000  0.000000
1 -1.220237  0.500000  0.000000
2  0.364589  0.500000 -1.041544
3  0.224896  0.500000  1.722356
4  1.525739  1.903656  0.607947
5 -2.030629 -0.151804 -0.695825
6  0.832581  0.973555 -0.180363

In [39]:
_=df.fillna(0,inplace=True)

In [40]:
df

          0         1         2
0  1.282884  0.000000  0.000000
1 -1.220237  0.000000  0.000000
2  0.364589  0.000000 -1.041544
3  0.224896  0.000000  1.722356
4  1.525739  1.903656  0.607947
5 -2.030629 -0.151804 -0.695825
6  0.832581  0.973555 -0.180363

In [41]:
df=pd.DataFrame(np.random.randn(6,3))

In [42]:
df

          0         1         2
0 -0.167403  0.596398  1.136251
1  0.156269  0.438106  1.223170
2 -1.034876  0.944720 -0.115100
3 -3.817440  0.241366  0.601944
4  0.283304 -2.147905 -0.583465
5  0.816207  1.149049 -1.264942

In [43]:
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA

In [44]:
df

          0         1         2
0 -0.167403  0.596398  1.136251
1  0.156269  0.438106  1.223170
2 -1.034876       NaN -0.115100
3 -3.817440       NaN  0.601944
4  0.283304       NaN       NaN
5  0.816207       NaN       NaN

In [46]:
df.fillna(method='ffill')

          0         1         2
0 -0.167403  0.596398  1.136251
1  0.156269  0.438106  1.223170
2 -1.034876  0.438106 -0.115100
3 -3.817440  0.438106  0.601944
4  0.283304  0.438106  0.601944
5  0.816207  0.438106  0.601944

In [47]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.167403  0.596398  1.136251
1  0.156269  0.438106  1.223170
2 -1.034876  0.438106 -0.115100
3 -3.817440  0.438106  0.601944
4  0.283304       NaN  0.601944
5  0.816207       NaN  0.601944

In [51]:
data=pd.Series([1,NA,3.5,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [52]:
df.fillna(data.mean())

          0         1         2
0 -0.167403  0.596398  1.136251
1  0.156269  0.438106  1.223170
2 -1.034876  3.833333 -0.115100
3 -3.817440  3.833333  0.601944
4  0.283304  3.833333  3.833333
5  0.816207  3.833333  3.833333

In [53]:
## 数据转换

In [54]:
data=pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})

In [55]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [56]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [59]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [60]:
data['v1']=range(7)

In [61]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [62]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [63]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [65]:
data.drop_duplicates(['k1','k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [76]:
data=pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],
                   'ounces':[4,3,12,6,7.5,8,3,5,6]
                  })

In [77]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [78]:
meat_to_animal={'bacon':'pig','pulled pork':'pig','pastrami':'cow','corned beef':'cow','honey ham':'pig','nova lox':'slamon'}

In [79]:
lowercased=data['food'].str.lower()

In [80]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [81]:
data['animal']=lowercased.map(meat_to_animal)

In [82]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  slamon

In [83]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    slamon
Name: food, dtype: object

In [84]:
## 数值替换

In [85]:
data=pd.Series([1., -999., 2., -999., -1000., 3.])

In [86]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [87]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [88]:
data.replace([-999,-1000],NA)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [89]:
data.replace([-999,-1000],[NA,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [90]:
data.replace({-999:NA,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [91]:
# 重命名轴索引

In [92]:
data=pd.DataFrame(np.arange(12).reshape(3,4),index=['Ohio','Colorado','New York'],columns=['one','two','three','four'])

In [93]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [103]:
transform=lambda x:x[:4].upper()

In [102]:
data.index.map(transform)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [105]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [106]:
data.index=data.index.map(transform)

In [107]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [108]:
data=pd.DataFrame(np.arange(12).reshape(3,4),index=['Ohio','Colorado','New York'],columns=['one','two','three','four'])

In [109]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [110]:
data.rename(index=str.title,columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [113]:
data.rename(index={'Ohio':'INDIANA'},columns={'three':'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [114]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [117]:
data.rename(index={'Ohio':'INDIANA'},inplace=True)

In [118]:
data

          one  two  three  four
INDIANA     0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [119]:
# 离散化和面元划分

In [120]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]

In [122]:
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [123]:
bins=[18,25,35,60,100]

In [124]:
cats=pd.cut(ages,bins)

In [127]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [128]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [130]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [131]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [132]:
pd.cut(ages,bins,right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [133]:
pd.cut(ages,bins,right=True)

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [134]:
group_names=['Youth','YoungAdult','MiddleAges','Senior']

In [135]:
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAges, MiddleAges, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAges < Senior]

In [136]:
data=np.random.rand(20)

In [137]:
data

array([0.61543638, 0.48667371, 0.05014657, 0.22076505, 0.77246983,
       0.1401785 , 0.87288884, 0.71349632, 0.61489151, 0.09647252,
       0.43033807, 0.47870536, 0.30706651, 0.72248439, 0.44963139,
       0.15435947, 0.03373677, 0.11796816, 0.90505068, 0.76172085])

In [138]:
pd.cut(data,4)

[(0.469, 0.687], (0.469, 0.687], (0.0329, 0.252], (0.0329, 0.252], (0.687, 0.905], ..., (0.0329, 0.252], (0.0329, 0.252], (0.0329, 0.252], (0.687, 0.905], (0.687, 0.905]]
Length: 20
Categories (4, interval[float64]): [(0.0329, 0.252] < (0.252, 0.469] < (0.469, 0.687] < (0.687, 0.905]]

In [139]:
pd.cut(data, 4, precision=2)

[(0.47, 0.69], (0.47, 0.69], (0.033, 0.25], (0.033, 0.25], (0.69, 0.91], ..., (0.033, 0.25], (0.033, 0.25], (0.033, 0.25], (0.69, 0.91], (0.69, 0.91]]
Length: 20
Categories (4, interval[float64]): [(0.033, 0.25] < (0.25, 0.47] < (0.47, 0.69] < (0.69, 0.91]]

In [141]:
data=np.random.rand(1000)

In [142]:
data

array([5.41099745e-01, 8.70716239e-01, 2.60004577e-01, 8.53352291e-02,
       4.64924729e-01, 4.62802035e-01, 8.42422781e-01, 4.92508252e-01,
       3.42263724e-01, 9.79229814e-01, 8.31224372e-01, 7.27194813e-01,
       1.04167140e-02, 6.13156663e-02, 8.17344786e-01, 9.35045308e-02,
       8.05481599e-01, 2.29842486e-01, 6.20419563e-01, 9.94229918e-01,
       7.41604493e-01, 3.11884509e-02, 8.60661364e-01, 1.61281056e-01,
       2.02901047e-01, 8.46115802e-03, 3.39866912e-01, 3.44390631e-01,
       8.18215387e-01, 8.66710071e-01, 2.95990528e-01, 3.08105563e-02,
       6.06212482e-01, 6.16426880e-03, 4.51666724e-01, 4.82471265e-01,
       9.80559908e-01, 2.81018012e-01, 4.59407826e-01, 2.34034347e-01,
       1.54680722e-01, 9.42120474e-01, 1.69884497e-01, 2.24024606e-01,
       5.91441616e-01, 4.31308539e-01, 4.62232688e-02, 2.61431275e-02,
       3.13824693e-01, 3.28058137e-01, 4.78990309e-01, 3.02217341e-01,
       7.26160207e-01, 1.96326630e-01, 3.21142537e-01, 8.14934477e-01,
       3.11228167e-01, 4.69420664e-01, 7.58917757e-01, 6.40969867e-01,
       9.35365009e-01, 7.62473165e-01, 3.89085992e-01, 7.33906101e-01,
       1.86081710e-01, 1.59229572e-01, 7.00958816e-01, 3.25578542e-01,
       5.48207669e-01, 9.14772226e-01, 7.85858507e-01, 4.97868033e-01,
       1.24304841e-01, 7.43151028e-01, 3.90613154e-01, 4.88852666e-01,
       7.96542708e-02, 9.50269148e-01, 8.77647322e-01, 7.81258145e-02,
       3.66260575e-01, 9.77584212e-01, 7.47317899e-01, 2.90757016e-01,
       6.05672125e-01, 3.69830686e-01, 5.60653506e-01, 3.72589496e-01,
       3.79488504e-01, 5.58606606e-01, 9.70495297e-01, 5.60981316e-01,
       4.65810542e-01, 6.31490499e-02, 9.25614797e-01, 2.28909804e-01,
       1.72677784e-01, 7.52770960e-01, 4.74449631e-01, 5.20992820e-02,
       6.04536958e-02, 8.29447929e-01, 8.25961875e-01, 5.45916473e-01,
       2.10499895e-01, 2.67921594e-01, 8.23306697e-01, 8.73695073e-01,
       6.07819261e-01, 4.49091668e-01, 1.70613539e-01, 6.63492985e-01,
       6.59084344e-01, 2.58593789e-01, 6.11400718e-01, 4.13800418e-01,
       4.38003685e-01, 4.72812501e-01, 5.28365540e-01, 9.59330557e-01,
       2.09991465e-01, 6.69278726e-01, 5.74031877e-01, 4.06997687e-01,
       6.80023578e-01, 5.44624032e-01, 8.41932748e-01, 7.32293920e-01,
       5.97837692e-01, 4.21853021e-01, 5.11508546e-01, 2.06383342e-01,
       7.60475167e-01, 2.81306300e-01, 5.86598111e-01, 3.86827625e-01,
       3.99654841e-01, 9.15840897e-01, 7.76958776e-01, 5.07605198e-02,
       4.35411387e-01, 7.16963040e-01, 7.86349966e-01, 7.39007694e-01,
       7.48893538e-01, 2.38561444e-01, 1.43363128e-01, 6.88374303e-01,
       3.00754001e-01, 1.30110263e-01, 3.00490289e-01, 5.14832668e-01,
       6.88013163e-01, 5.29165781e-02, 2.26289831e-01, 7.29554755e-01,
       9.74567107e-02, 2.58245202e-01, 9.14253792e-01, 5.10679897e-01,
       7.14452279e-01, 6.78237532e-01, 8.15130102e-01, 5.19769851e-01,
       7.85161534e-01, 8.10050657e-01, 4.67775627e-01, 9.29432739e-01,
       5.64556218e-02, 3.64449912e-01, 8.45592909e-01, 3.62362096e-01,
       7.51273608e-01, 3.79281226e-01, 6.41863894e-01, 7.50796692e-01,
       1.68180613e-01, 7.74932493e-01, 1.63355760e-01, 7.66645225e-01,
       4.85505611e-01, 2.42417120e-01, 1.82496864e-01, 9.93791972e-01,
       3.82150279e-01, 4.06647059e-01, 8.07003711e-01, 9.37278449e-01,
       1.76745354e-01, 2.05606607e-01, 7.29258884e-01, 6.36561707e-01,
       1.97942350e-01, 3.62480903e-01, 5.83038040e-02, 6.00193068e-01,
       4.93736585e-01, 8.94524274e-01, 9.37029084e-01, 3.65518248e-01,
       6.62591571e-01, 7.37963474e-02, 8.08764844e-01, 7.95226582e-01,
       8.46888555e-01, 6.33124239e-01, 7.42133014e-01, 6.36387816e-01,
       8.01996357e-01, 4.73522358e-01, 9.91055666e-01, 4.20225377e-01,
       1.42509735e-01, 6.21500060e-01, 9.99454990e-01, 6.94468931e-01,
       7.36641613e-01, 7.01166340e-01, 8.60203705e-02, 8.81591975e-01,
       7.64501225e-01, 1.16694093e-01, 2.20838858e-01, 8.16555974e-01,
       9.60801747e-01, 9.59194397e-01, 3.89692510e-01, 4.80958091e-01,
       2.94692408e-01, 9.29457377e-01, 7.19949627e-01, 2.88776658e-01,
       5.63813866e-01, 2.99788505e-01, 4.21021711e-01, 9.22586931e-01,
       1.91781821e-01, 3.14661334e-01, 9.70730751e-01, 4.93273807e-01,
       1.32567551e-01, 4.48908069e-01, 8.37413903e-01, 1.05552330e-01,
       6.47997273e-01, 8.68296239e-01, 8.66302720e-01, 7.39450159e-01,
       9.59924900e-01, 1.65847214e-02, 3.20187780e-01, 6.48757385e-01,
       5.21948955e-01, 5.57929482e-01, 9.48788058e-01, 5.77979425e-01,
       4.55340080e-01, 5.28698796e-01, 7.27539999e-01, 8.01504490e-01,
       8.46878744e-01, 8.41384459e-01, 3.14330319e-01, 4.99795029e-01,
       9.14144305e-01, 1.91997941e-01, 7.95882488e-02, 9.20438771e-01,
       2.73863164e-01, 8.27393507e-01, 6.75711225e-01, 4.79010052e-01,
       2.27128422e-01, 5.50428247e-01, 2.39560283e-01, 2.95246099e-01,
       8.79798193e-01, 9.92301981e-01, 8.08776364e-01, 7.44431294e-01,
       2.44846569e-01, 4.61449874e-04, 9.20668668e-01, 6.57482275e-01,
       8.22453715e-01, 6.87065138e-01, 1.57867089e-01, 7.99462270e-01,
       7.39185751e-01, 9.61138125e-01, 2.84920977e-02, 5.97611637e-01,
       2.39822966e-01, 4.33598371e-02, 5.49934456e-01, 1.34178278e-01,
       5.24891745e-01, 4.86420635e-01, 3.13237853e-01, 3.49826504e-01,
       9.53415076e-01, 1.27164630e-01, 3.77169453e-01, 4.28560310e-01,
       8.71649057e-01, 4.53197294e-01, 4.99315831e-01, 9.68060155e-01,
       7.75785128e-01, 6.68218618e-01, 7.04841995e-01, 3.66484811e-02,
       2.92699201e-01, 6.29139982e-01, 6.62892521e-01, 1.98031610e-01,
       5.40767439e-01, 1.89016174e-01, 1.47709711e-01, 5.71281399e-01,
       6.04106382e-01, 4.52023234e-01, 1.90886400e-01, 8.49522782e-01,
       4.61995456e-02, 7.02033346e-01, 8.13441862e-01, 6.14995970e-01,
       3.31041771e-01, 7.51534339e-01, 4.48824878e-01, 5.15122652e-01,
       1.20806899e-02, 6.76796956e-01, 9.15899131e-01, 8.62507003e-01,
       8.21312568e-01, 7.81756264e-02, 2.61564828e-01, 4.11847266e-01,
       9.30067693e-01, 9.30822421e-01, 6.38386958e-01, 8.88455054e-02,
       7.98657046e-01, 7.14344147e-01, 2.98657855e-01, 5.98074013e-01,
       4.32866107e-01, 6.49798550e-01, 9.21819411e-03, 4.56528541e-01,
       2.59703290e-01, 1.90230886e-01, 4.21077504e-02, 6.94781549e-01,
       1.97107237e-01, 4.45866011e-01, 4.53052235e-01, 9.59324013e-01,
       2.55919340e-01, 4.63618142e-01, 7.24755547e-01, 5.82782306e-01,
       7.23313298e-01, 6.78202632e-01, 5.03079211e-02, 5.44139496e-01,
       2.81808641e-01, 1.21009988e-01, 5.51667761e-01, 6.93441756e-01,
       3.90526101e-01, 7.99515340e-01, 7.14246141e-01, 9.94955110e-01,
       1.12611778e-01, 4.14126183e-01, 7.49635293e-01, 1.96281340e-01,
       5.99134107e-01, 1.25873673e-01, 1.92838638e-01, 4.58312482e-01,
       9.52674281e-01, 2.68533598e-01, 1.18738589e-01, 4.15946665e-01,
       9.58232960e-01, 4.32963713e-01, 4.43147144e-01, 9.81710565e-01,
       6.22382544e-01, 6.84082997e-01, 4.80489433e-01, 8.77044157e-01,
       5.70124182e-01, 7.31705672e-01, 5.19559506e-01, 7.23223919e-01,
       5.70049756e-01, 1.48894357e-03, 7.12571152e-01, 4.34827202e-02,
       4.86439911e-02, 9.02483263e-01, 9.20647124e-01, 2.85426791e-01,
       6.16831673e-01, 5.97907712e-01, 3.59319037e-01, 4.94202632e-02,
       7.56232341e-01, 6.48521008e-01, 4.96692417e-01, 9.44895906e-02,
       3.27210656e-01, 2.26220587e-01, 3.91174723e-01, 1.42251926e-01,
       7.14934500e-01, 9.79089261e-01, 3.94604540e-01, 3.60076642e-01,
       8.97157112e-01, 5.14014985e-01, 6.01484176e-01, 8.97755462e-01,
       8.30774438e-01, 6.91166415e-01, 7.24458190e-01, 3.43467070e-01,
       5.45864045e-01, 5.36091469e-01, 1.60354441e-01, 4.18196296e-02,
       9.87682783e-01, 2.57133033e-01, 3.74452684e-01, 4.22583854e-02,
       3.51607464e-01, 6.85399465e-01, 3.25476273e-01, 1.34017802e-01,
       3.96236440e-02, 8.92645763e-01, 4.86792394e-01, 4.44599232e-02,
       6.39897994e-01, 5.00666846e-02, 3.02171288e-01, 2.77468059e-01,
       2.04820202e-01, 3.61395042e-01, 7.76570498e-01, 7.37438183e-01,
       9.87437476e-01, 9.82855895e-01, 2.49103751e-01, 1.25588815e-02,
       1.56143554e-02, 1.89246568e-01, 3.04365629e-01, 1.01023748e-01,
       8.70385098e-01, 5.53324708e-01, 5.84165391e-01, 3.90174568e-01,
       7.69080610e-01, 6.95195773e-01, 7.99442711e-01, 8.34499300e-01,
       2.94434163e-02, 6.41030956e-01, 5.90827852e-01, 7.94814094e-01,
       3.07180783e-01, 9.37221106e-01, 6.69168759e-01, 4.02691441e-01,
       1.95897650e-01, 7.63526081e-01, 5.45966081e-02, 9.49459248e-01,
       7.25311867e-01, 8.91588714e-02, 9.20313262e-01, 1.53391522e-01,
       3.38402032e-01, 1.07135801e-01, 4.07585241e-01, 8.09084001e-01,
       8.37231380e-01, 6.80519092e-01, 4.66062398e-01, 5.06949828e-01,
       1.67207929e-01, 4.52162993e-01, 1.54019865e-01, 9.42060591e-01,
       7.69284040e-01, 5.01194695e-01, 9.08628891e-01, 8.84376560e-01,
       3.78517439e-01, 9.20861426e-01, 3.31940615e-01, 9.14301032e-01,
       9.08310207e-01, 3.64467277e-01, 9.83523616e-01, 6.46067069e-01,
       3.44014410e-01, 5.73979633e-01, 5.77142029e-01, 1.78968760e-02,
       1.40527459e-02, 3.84813763e-01, 8.12282055e-01, 4.90367646e-01,
       1.67275510e-01, 7.66403735e-01, 9.06945101e-01, 2.19627998e-01,
       1.69934285e-01, 3.31721548e-01, 5.86478843e-02, 3.80242118e-01,
       7.90784298e-01, 2.53640845e-01, 9.65286731e-01, 6.69810882e-02,
       3.93323069e-02, 9.53921701e-01, 6.03799691e-01, 4.52641929e-02,
       7.17658394e-01, 6.21620207e-01, 8.82487892e-01, 4.79168057e-01,
       3.25882885e-01, 4.16325462e-01, 1.93505478e-01, 3.88518316e-02,
       1.22179019e-01, 8.88474330e-01, 5.43339684e-01, 5.69621929e-02,
       1.40794618e-01, 5.79245587e-01, 1.90622001e-01, 9.10019398e-01,
       3.43729384e-01, 4.95310730e-01, 9.52902443e-02, 6.13081861e-01,
       4.73825947e-01, 4.21726550e-01, 1.57736380e-01, 3.61289570e-02,
       2.49575728e-01, 6.31031417e-02, 4.19542533e-01, 4.76934489e-01,
       6.20781551e-03, 6.12769792e-02, 2.09026892e-01, 6.69614543e-01,
       7.87268948e-01, 5.96669837e-01, 3.94441440e-01, 7.06189392e-01,
       3.85713798e-01, 7.24083912e-01, 2.03450427e-01, 4.93503237e-01,
       1.34385709e-01, 2.95229267e-02, 8.93123744e-01, 3.60974988e-01,
       7.57853240e-01, 4.09924085e-01, 8.17778648e-01, 2.56536058e-01,
       7.55804675e-01, 2.15245365e-01, 8.20053916e-01, 7.00692600e-03,
       8.26749082e-01, 5.46979019e-01, 4.23556286e-01, 3.42520077e-01,
       2.23340079e-01, 5.16060396e-01, 7.94365558e-01, 3.49933554e-02,
       7.43867097e-01, 8.43124698e-01, 2.29352833e-01, 2.27793067e-01,
       5.49786304e-01, 2.09535830e-01, 9.80589958e-01, 3.28184359e-01,
       3.79620809e-01, 5.40742262e-01, 3.57844550e-01, 9.78565143e-01,
       6.27194214e-01, 5.71590783e-01, 2.23053020e-01, 9.76833892e-01,
       2.06894003e-01, 6.06708319e-01, 1.33136378e-01, 4.10091476e-01,
       1.11024432e-01, 3.39752878e-02, 5.05297615e-01, 1.74667279e-01,
       5.94883146e-01, 7.70044355e-01, 1.75666902e-01, 4.35565844e-01,
       3.22756011e-01, 6.91482079e-01, 6.43959130e-01, 9.06079887e-01,
       7.13232586e-01, 1.50957320e-01, 5.06952092e-01, 3.88188785e-01,
       9.32289875e-01, 3.98416605e-01, 9.45260480e-01, 1.99467683e-02,
       6.87590230e-01, 2.40002555e-02, 6.22589457e-01, 1.18347485e-01,
       8.55626793e-01, 1.75217259e-02, 8.82219985e-01, 1.69066329e-01,
       6.17763755e-01, 3.30155297e-01, 1.33234523e-01, 8.96357141e-01,
       8.10111516e-01, 3.34173674e-01, 8.90555150e-01, 9.14958923e-01,
       8.02895398e-01, 1.80914706e-01, 8.28460480e-02, 4.59647553e-01,
       7.36570453e-01, 7.22859032e-01, 7.21283284e-01, 1.16877295e-01,
       1.96827581e-01, 1.32924169e-01, 3.24960261e-01, 3.50103922e-01,
       2.45007794e-01, 8.08616507e-01, 4.21012921e-01, 7.78773346e-01,
       5.52773816e-01, 7.42847630e-01, 1.47100939e-01, 1.76357062e-01,
       9.09919964e-01, 3.77352933e-01, 7.30981124e-01, 9.07034992e-01,
       1.24205025e-01, 5.42853792e-01, 2.84966148e-01, 2.33249092e-01,
       9.40573132e-01, 3.48120528e-01, 5.93323437e-02, 2.21974597e-01,
       8.03648784e-01, 3.94718345e-01, 1.98346138e-01, 9.31987474e-01,
       9.37440035e-01, 8.25806677e-01, 2.87539612e-01, 3.98612888e-01,
       7.47315583e-01, 5.17648393e-01, 1.74853463e-01, 9.39193538e-01,
       4.34055025e-01, 1.95338296e-01, 2.15305692e-01, 6.61936351e-01,
       7.55396114e-01, 5.74580132e-01, 4.88038375e-01, 5.95791112e-01,
       4.43038242e-01, 5.70016876e-01, 6.07611057e-01, 5.15379329e-01,
       7.50632887e-02, 6.40664763e-01, 4.56598723e-01, 3.25785288e-01,
       2.28713442e-02, 2.04495002e-01, 1.15663806e-01, 3.15884166e-01,
       5.02274670e-01, 5.49014129e-01, 5.03620840e-01, 1.28544126e-01,
       9.17255895e-01, 4.19963715e-01, 6.65392419e-01, 7.38478412e-01,
       4.05472207e-01, 5.07953485e-01, 3.07423409e-01, 7.73376632e-01,
       8.49951525e-01, 5.52726737e-01, 1.80918598e-01, 3.20454515e-01,
       9.66563483e-01, 8.45522861e-01, 9.92481533e-01, 8.95193548e-01,
       4.98739457e-01, 1.87880014e-01, 8.72716164e-01, 7.33058694e-01,
       5.26887183e-01, 9.93742179e-01, 9.64507685e-01, 2.62735698e-01,
       7.38498384e-01, 1.06658825e-03, 6.21026269e-01, 7.30658032e-01,
       7.98348536e-01, 8.45782724e-01, 3.19095543e-01, 6.35113565e-01,
       8.65290280e-01, 9.23544430e-01, 2.93398237e-01, 4.64504963e-01,
       2.95230120e-01, 2.67989945e-01, 2.88268372e-01, 8.08787380e-01,
       9.16771422e-01, 9.40066172e-01, 9.00003298e-02, 5.92836759e-01,
       8.02039153e-01, 4.32862905e-01, 9.24301831e-01, 5.02760066e-01,
       8.81198269e-01, 3.67485517e-03, 7.75161781e-01, 8.07729947e-01,
       4.39351581e-02, 6.26109759e-01, 6.57699320e-01, 5.31316148e-01,
       8.08887698e-01, 7.84343478e-01, 8.32768629e-01, 1.26225841e-01,
       8.66910352e-01, 4.53286387e-01, 5.02179618e-01, 7.10109951e-01,
       7.16130029e-02, 4.59130606e-02, 4.75082454e-01, 1.02214185e-01,
       2.58492860e-01, 1.43171924e-01, 9.14170209e-01, 2.32069737e-01,
       8.64346433e-01, 6.40777821e-02, 4.21570392e-01, 2.93197955e-01,
       2.26083726e-01, 9.87665861e-01, 3.85889528e-01, 3.18936319e-01,
       8.16518960e-01, 2.80802285e-01, 4.44955322e-01, 2.12307497e-01,
       6.73493246e-02, 6.85117427e-01, 7.33175573e-01, 9.51065585e-01,
       7.00084173e-01, 8.57633340e-01, 5.39217832e-01, 4.21697553e-01,
       5.67493788e-01, 8.37810336e-01, 3.70792817e-01, 6.22227451e-01,
       4.03313470e-01, 1.33660860e-01, 2.98179221e-01, 6.63919300e-01,
       1.83018935e-01, 7.70951037e-01, 8.56289975e-01, 2.04243240e-01,
       4.26459519e-01, 4.20865911e-01, 7.19148761e-01, 5.37860700e-01,
       2.99928822e-01, 2.20615729e-01, 6.80363188e-01, 9.98295624e-01,
       7.95809860e-01, 3.58914031e-01, 8.99448413e-02, 4.57875638e-01,
       5.34697960e-01, 6.30256192e-01, 5.65694813e-01, 4.86587069e-01,
       1.67621414e-01, 8.90880940e-01, 7.92667312e-01, 4.47105468e-01,
       1.67395543e-01, 7.44930326e-01, 2.04662764e-01, 2.10452363e-01,
       5.53241582e-02, 9.82049760e-01, 6.44154338e-01, 9.66494626e-01,
       2.48717843e-01, 5.50650289e-01, 6.78944058e-01, 1.97133216e-01,
       8.32209297e-01, 5.41562970e-01, 3.86057316e-01, 1.18610485e-01,
       6.46900010e-01, 3.58806727e-01, 1.68446602e-03, 4.34111539e-01,
       7.75331882e-01, 2.98893066e-01, 5.46023399e-01, 2.43583253e-01,
       6.76672213e-02, 1.31190101e-02, 9.76340122e-01, 7.28351297e-01,
       7.78897022e-01, 7.57320139e-01, 8.07447052e-02, 7.88329623e-01,
       3.58860002e-01, 1.41672904e-01, 8.93580525e-01, 2.55519161e-01,
       9.55798827e-01, 5.97458039e-01, 2.93456042e-01, 5.88203043e-02,
       5.02348838e-01, 9.32211462e-01, 9.92437635e-01, 5.21288177e-01,
       5.93720700e-01, 1.57793479e-01, 4.57691242e-01, 6.66307209e-01,
       3.05874113e-01, 3.69462810e-01, 3.29216545e-01, 6.11217598e-01,
       8.98757754e-01, 4.25404384e-01, 9.68811136e-01, 7.98535143e-01,
       8.94213905e-01, 9.85484475e-01, 6.43546214e-01, 3.91844904e-01,
       9.42924269e-01, 2.87780472e-01, 3.05702910e-01, 3.93119963e-01,
       9.70724254e-01, 8.86496444e-01, 3.09080124e-01, 6.28309987e-01,
       9.74799647e-01, 3.45593104e-01, 3.17513896e-01, 2.56122223e-01,
       5.20589901e-01, 5.98628636e-01, 7.27198082e-01, 3.29778337e-02,
       7.65981584e-01, 2.05507883e-01, 7.55911636e-01, 3.42142850e-01,
       6.45766632e-01, 4.31947597e-01, 3.99732209e-01, 3.05142747e-01,
       2.85372992e-02, 1.12363475e-01, 6.63484619e-01, 9.49312998e-01,
       5.39085122e-01, 6.34911358e-01, 1.97882535e-01, 7.82408053e-01,
       6.34251636e-01, 4.06172889e-01, 6.48984244e-02, 4.85281209e-02,
       5.00225580e-03, 2.92844917e-02, 1.89224943e-01, 4.93355351e-01,
       4.16850923e-01, 1.16016680e-02, 6.77667872e-01, 7.11988981e-01,
       9.07029191e-01, 9.16013165e-01, 6.41578461e-01, 2.47056182e-01,
       3.37492411e-01, 2.65912007e-01, 9.23023822e-01, 3.46026220e-01,
       6.56093682e-01, 5.60550941e-01, 1.63998372e-01, 7.98069139e-01,
       1.12084466e-01, 5.55556421e-01, 5.68235210e-01, 2.69900174e-02,
       4.46448984e-01, 5.84027432e-01, 3.94305142e-01, 5.98997233e-01,
       9.16285250e-01, 1.30480306e-01, 2.90957708e-01, 9.80875905e-01,
       2.99837462e-01, 8.91316618e-01, 5.54988541e-01, 6.81254329e-01,
       2.56404546e-01, 8.68341614e-01, 4.36446645e-01, 6.94908322e-01,
       5.08517269e-01, 2.90281455e-01, 8.42063322e-01, 4.79428962e-01,
       1.10611261e-01, 7.60416211e-01, 4.17668467e-01, 4.57861218e-01,
       9.36416578e-02, 1.44270452e-01, 1.49058978e-01, 7.07063316e-01,
       4.46418651e-01, 8.03112841e-01, 2.25496099e-01, 5.90870801e-01,
       9.44708510e-01, 6.19541095e-01, 1.79635625e-01, 9.73944620e-01])

In [143]:
cats=pd.qcut(data,4)

In [144]:
cats

[(0.502, 0.751], (0.751, 0.999], (0.257, 0.502], (-0.000539, 0.257], (0.257, 0.502], ..., (0.502, 0.751], (0.751, 0.999], (0.502, 0.751], (-0.000539, 0.257], (0.751, 0.999]]
Length: 1000
Categories (4, interval[float64]): [(-0.000539, 0.257] < (0.257, 0.502] < (0.502, 0.751] < (0.751, 0.999]]

In [146]:
pd.value_counts(cats)

(0.751, 0.999]        250
(0.502, 0.751]        250
(0.257, 0.502]        250
(-0.000539, 0.257]    250
dtype: int64

In [147]:
#检测和过滤异常值

In [148]:
data=pd.DataFrame(np.random.randn(1000,4))

In [150]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.066178    -0.018765     0.039902     0.033039
std       0.982400     1.016475     1.025453     1.001763
min      -3.766760    -3.225787    -3.428037    -3.313506
25%      -0.711691    -0.694632    -0.689722    -0.669563
50%      -0.050084    -0.007581     0.075120     0.037438
75%       0.588299     0.689946     0.735537     0.699894
max       2.974599     3.830850     3.458916     3.149576

In [158]:
col=data[2]

In [160]:
col[np.abs(col) > 3]

556    3.247392
557   -3.428037
645    3.458916
Name: 2, dtype: float64

In [162]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
250 -3.304330 -0.261038  0.162536 -0.479579
417 -3.766760  0.595899  0.954695 -2.121806
496 -0.910425  0.778273 -0.082051  3.149576
556 -0.507565  0.762680  3.247392 -1.417587
557 -0.494791 -0.050197 -3.428037  0.789963
583  0.611009 -3.225787 -0.031348 -0.183738
585 -0.760633  0.789589  1.331846 -3.313506
645 -0.168570  0.176842  3.458916 -0.443774
907 -0.801113  3.830850  0.668772  0.170583

In [163]:
data[np.abs(data) > 3]=np.sign(data)*3

In [164]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.065107    -0.019370     0.039624     0.033203
std       0.978844     1.012971     1.021913     1.000308
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.711691    -0.694632    -0.689722    -0.669563
50%      -0.050084    -0.007581     0.075120     0.037438
75%       0.588299     0.689946     0.735537     0.699894
max       2.974599     3.000000     3.000000     3.000000

In [165]:
# 排列和随机采样

In [166]:
df = pd.DataFrame(np.arange(5*4).reshape(5,4))

In [167]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [168]:
sampler=np.random.permutation(5)

In [169]:
sampler

array([4, 3, 2, 0, 1])

In [170]:
df[3]

0     3
1     7
2    11
3    15
4    19
Name: 3, dtype: int32

In [180]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3
1   4   5   6   7

In [182]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19

In [183]:
choice=pd.Series([5,7,-1,6,4])

In [189]:
choice.sample(n=10,replace=True)

1    7
1    7
2   -1
3    6
2   -1
4    4
2   -1
0    5
0    5
1    7
dtype: int64

In [190]:
# 计算指标 /哑变量

In [191]:
###字符串操作

In [206]:
val='a,b, guido'

In [207]:
val.split(',')

['a', 'b', ' guido']

In [208]:
pieces=[x.strip() for x in val.split(',')]

In [209]:
pieces

['a', 'b', 'guido']

In [210]:
first, second, third = pieces

In [211]:
first+'::'+second+'::'+third

'a::b::guido'

In [212]:
'::'.join(pieces)

'a::b::guido'

In [213]:
val.index(',')

1

In [214]:
val.find(':')

-1

In [215]:
val.replace(',',':')

'a:b: guido'

In [219]:
val.count(',')

2

In [220]:
val

'a,b, guido'

In [ ]:
#